"""
У конспекті ми розглянули приклад про розбиття суми на монети. Маємо набір монет [50, 25, 10, 5, 2, 1]. Уявіть, що ви розробляєте систему для касового апарату, яка повинна визначити оптимальний спосіб видачі решти покупцеві.
Вам необхідно написати дві функції для касової системи, яка видає решту покупцеві:
Функція жадібного алгоритму find_coins_greedy. Ця функція повинна приймати суму, яку потрібно видати покупцеві, і повертати словник із кількістю монет кожного номіналу, що використовуються для формування цієї суми. Наприклад, для суми 113 це буде словник {50: 2, 10: 1, 2: 1, 1: 1}. Алгоритм повинен бути жадібним, тобто спочатку вибирати найбільш доступні номінали монет.
Функція динамічного програмування find_min_coins. Ця функція також повинна приймати суму для видачі решти, але використовувати метод динамічного програмування, щоб знайти мінімальну кількість монет, необхідних для формування цієї суми. Функція повинна повертати словник із номіналами монет та їх кількістю для досягнення заданої суми найефективнішим способом. Наприклад, для суми 113 це буде словник {1: 1, 2: 1, 10: 1, 50: 2}
Порівняйте ефективність жадібного алгоритму та алгоритму динамічного програмування, базуючись на часі їх виконання або О великому та звертаючи увагу на їхню продуктивність при великих сумах. Висвітліть, як вони справляються з великими сумами та чому один алгоритм може бути більш ефективним за інший у певних ситуаціях. Свої висновки додайте у файл readme.md домашнього завдання.
"""
import time

def find_coins_greedy(amount, coins=[9, 7, 6, 1]):
    result = {}
    for coin in coins:
        count = amount // coin
        if count > 0:
            result[coin] = count
            amount -= count*coin
    return result

def find_min_coins(amount, coins=[9, 7, 6, 1]):
    dp = [float("inf")] * (amount + 1)
    dp[0] = 0
    used_coins = [None] * (amount + 1)

    for coin in coins:
        for x in range(coin, amount + 1):
            if dp[x - coin] + 1 < dp[x]:
                dp[x] = dp[x - coin] + 1
                used_coins[x] = coin

    result = {}
    while amount > 0:
        coin = used_coins[amount]
        if coin is None:
            return {}
        result[coin] = result.get(coin, 0) + 1
        amount -= coin

    return result

amount = 111

start_greedy = time.time()
greedy_result = find_coins_greedy(amount)
end_greedy = time.time()

start_dp = time.time()
dp_result = find_min_coins(amount)
end_dp = time.time()

print(f"Жадібний алгоритм:")
print(f"Результат: {greedy_result}")
print(f"Час виконання: {end_greedy - start_greedy:.6f}")

print(f"Динамічне програмування:")
print(f"Результат: {dp_result}")
print(f"Час виконання: {end_dp - start_dp:.6f}")
        
